package Glossary;

import java.util.Scanner;

public class Glossary_General {

/*

    - IDE (Integrated Development Environment) – это интегрированная, единая среда разработки,
    которая используется разработчиками для создания различного программного обеспечения.

    - FrameWorks Java — тело предварительно написанного кода, действующего как шаблон или скелет,
    который разработчик может затем использовать и повторно использовать для создания приложения,
    заполняя свой код по мере необходимости, чтобы заставить приложение работать так, как они намереваются

    - Library (Библиотеки) — это код, предназначенный для решения конкретной задачи.

    -API (Application Programming Interface или программный интерфейс приложения) – это совокупность способов,
     протоколов, инструментов, с помощью которых различные программы обмениваются своими возможностями,
     данными, выполняют разные функции.


 */




}
