package Glossary;

public class IDE {

/*

        IDE (Integrated Development Environment) – это интегрированная, единая среда разработки,
    которая используется разработчиками для создания различного программного обеспечения.
    IDE представляет собой комплекс из нескольких инструментов, а именно: текстового редактора,
    компилятора либо интерпретатора, средств автоматизации сборки и отладчика.
    Помимо этого, IDE может содержать инструменты для интеграции с системами управления версиями
    и другие полезные утилиты. Есть IDE, которые предназначены для работы только с одним языком программирования,
    однако большинство современных IDE позволяет работать сразу с несколькими.

        Чем IDE отличается от текстового редактора?
    IDE представляет собой более сложный инструмент, чем обычный текстовый редактор.
    Несмотря на то, что в текстовых редакторах есть масса полезных функций вроде подсветки синтаксиса,
    единственная их задача – обеспечивать работу с кодом.
    То есть для полноценной разработки вам понадобится еще хотя бы компилятор и отладчик.

    IDE уже содержит в себе все эти и другие полезные компоненты. По сути, термин IDE обозначает то,
    что у вас под рукой будет все, что необходимо для разработки приложений и программ.

    Какая среда разработки подойдет конкретно для вас? В этом вопросе надо основываться на четырех факторах:

    - язык разработки;
    - простота использования;
    - на каких платформах работает;
    - стоимость.

    Примеры IDE:

    - IntelliJ IDEA - лучшая IDE для Java - разработчиков (премиум Java-IDE);
    - Microsoft Visual Studio
    - Eclipse - популярная IDE для Java-разработчиков (бесплатное программное обеспечение);
    - NetBeans - лучшая Java-IDE, развиваемая Oracle (бесплатное программное обеспечение);
    - Android Studio - Java-IDE, предназначенная для Android-разработчиков;






















 */
}
