package Java_Extend.Swing;

public class Swing_General {

    /*

    Что такое Swing в Java?
    Swing в Java – это легкий инструментарий с графическим интерфейсом,
    который имеет широкий спектр виджетов для создания оптимизированных оконных приложений.
    Это часть JFC (Java Foundation Classes). Он построен на основе AWT API и полностью написан на Java.
    Он не зависит от платформы в отличие от AWT и имеет легкие компоненты.


    Контейнерный класс
    Любой класс, в котором есть другие компоненты,
    называется контейнерным классом.
    Для создания приложений с графическим интерфейсом необходим как минимум один класс контейнеров.

    Ниже приведены три типа контейнерных классов:

    Панель – используется для организации компонентов в окне.
    Рамка – полностью функционирующее окно со значками и заголовками.
    Диалог – это как всплывающее окно, но не полностью функциональное, как рамка.


    Разница между AWT и Swing:

                AWT	                                    SWING
        платформо-зависимая                     не зависит
        не соответствует MVC                    соответствует MVC
        Меньше компонентов                      Более мощные компоненты
        Не поддерживает подключаемый            Поддержка подключаемого внешнего вида
        внешний вид и ощущение
        тяжеловесный                            легкий


     */
}