package Android;

public class Android_General {
/*
                                Что нужно знать Андроид разработчику
    - языки программирования Java, Kotlin
    - основы Android
    - Material Design -  это язык дизайна Google, который представляет собой большое руководство по визуальному,
      динамическому и интерактивному дизайну на разных платформах и устройствах.
    - ViewPager — это Диспетчер макетов, позволяющий реализовать навигацию жестурал
    - RecyclerView предназначен для оптимизации работы со списками
    - Room(альтернатива  DBFlow) - это высокоуровневый интерфейс для работы с базой данных SQLite
    - MySql - это реляционная база данных (СУБД). Реляционная — значит внутри неё есть данные,
      которые связаны между собой, и эту связь можно представить в виде таблиц.
    - Retrofit - популярная и удобная библиотека, которая используется, если приложению необходимо работать с сервером
    - Паттерн MVVM (Model-View-ViewModel) позволяет отделить логику приложения от визуальной части (представления).
      делит приложение на три функциональные части:
        Model — основная логика программы (работа с данными, вычисления, запросы и так далее)
        View — вид или представление (пользовательский интерфейс)
        ViewModel — модель представления, которая служит прослойкой между
        знать:
        - Coroutine (корутины) – это еще один способ создания асинхронного кода.
          Это потоки исполнения кода, которые организуются поверх аппаратных (системных) потоков)
        - Koin — это небольшая библиотека для написания внедрений зависимостей. (аналог dagger)
    - Firebase - это облачная база данных, которая позволяет пользователям хранить
      и получать сохраненную информацию, а также имеет удобные средства и методы взаимодействия с ней.
    - WorkManager из Android Jetpack -  используется для управления фоновыми рабочими задачами.
    -








 */

}
