package Java_Extend.Other;

public class Exception_Try_Catch_Finally_General {

   /*


   Обработка исключений в Java основана на использовании в программе следующих ключевых слов:

        - try – определяет блок кода, в котором может произойти исключение;
        - catch – определяет блок кода, в котором происходит обработка исключения;
        - finally – определяет блок кода, который является необязательным,
        но при его наличии выполняется в любом случае независимо от результатов выполнения блока try.

        Эти ключевые слова используются для создания в программном коде специальных обрабатывающих конструкций:
        try{}catch, try{}catch{}finally, try{}finally{}.

        - throw – используется для возбуждения исключения;
        - throws – используется в сигнатуре методов для предупреждения, о том что метод может выбросить исключение.







    */



}
